app/controllers/movies_controller.rb

  def index
    if params[:title]
      @movies = Movie.where("title like ?", "%#{params[:title]}%")
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (title like %'alad'%)
SELECT "movies".* FROM "movies" ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "rating" = 'PG-13', "updated_at" = '2012-01-14 20:04:30.845356' WHERE "movies"."id" = 7